# Nginx: настройка частоты запросов

Для настройки и ограничения частоты запросов (по заданному ключу или с определенного IP-адреса) нужен модуль `ngx_http_limit_req_module`.

Основной шаблон конфигурации выглядит вот так:

    http {
        limit_req_zone $binary_remote_addr zone=one:10m rate=1r/s;
    
        ...
    
        server {
    
            ...
    
            location /search/ {
                limit_req zone=one burst=5;
            }   

     

На наших продуктивных web-фронтах настроено так:

    limit_req_zone $binary_remote_addr zone=one:10m rate=30r/s;
      limit_req_status            403;

### Здесь:
- Ключ `$binary_remote_addr` — это бинарное представление IP адреса, с которого поступает запрос. Бинарное потому, что оно занимает меньше места чем строковое.
- зона `one` — заданного размера (10 мегабайт в данном случае) часть памяти, в которой будет храниться информация о состоянии IP и его обращениях к серверу. Обозначенную зону мы применяем на нужный `location` (в случае наших продуктивных web-фронтов данная зона применяется ко всем `location`). 
- `rate` — лимит на количество обращений за определённый отрезок времени, в данном случае 30 реквестов в секунду.

### При работе данной схемы происходит следующее:
Если с какого-то IP-адреса будет приходить БОЛЬШЕ, чем 30 запросов за одну секунду к любому `location`, первые 30 запросов обработаются, в ответ на 31-й и следующие запросы будет отдана ошибка 403 (403 Forbidden, доступ запрещен).

Директив `limit_req` может быть несколько. Например, следующая конфигурация ограничивает скорость обработки запросов, поступающих с одного IP-адреса, и в то же время ограничивает скорость обработки запросов одним виртуальным сервером:

    limit_req_zone $binary_remote_addr zone=perip:10m rate=1r/s;
    limit_req_zone $server_name zone=perserver:10m rate=10r/s;
    
    server {
        ...
        limit_req zone=perip burst=5 nodelay;
        limit_req zone=perserver burst=10;
    }

Директивы наследуются с предыдущего уровня при условии, что на данном уровне не описаны свои директивы `limit_req`.

